# Imaad Ullah
# Email: imaad3358@gmail.com

# Methods of Creating DataFrames in Python

In [59]:
import pandas as pd

## Method 1: Creating Pandas DataFrame from lists of lists.

In [60]:
lists = [['Inayat', 54, 60000],['Imaad', 24, 0],['Atta', 22, 35000],
         ['Kaleem', 15, 0],['Zaki', 14, 0],['Basit', 13, 0],
         ['Numan', 12, 0],['Hazqeel', 3, 0],['Aarfeen', 3, 0],
         ['Yaseen', 1, 0],['Aaiza', 0.5, 0]]

In [72]:
method1_df = pd.DataFrame(data=lists, columns=['Name', 'Age', 'Salary'])
method1_df

       Name   Age  Salary
0    Inayat  54.0   60000
1     Imaad  24.0       0
2      Atta  22.0   35000
3    Kaleem  15.0       0
4      Zaki  14.0       0
5     Basit  13.0       0
6     Numan  12.0       0
7   Hazqeel   3.0       0
8   Aarfeen   3.0       0
9    Yaseen   1.0       0
10    Aaiza   0.5       0

## Method 2: Creating DataFrame from dict of narray/lists

In [74]:
r_dic = {'Name': ['Inayat', 'Imaad', 'Atta', 'Kaleem'],
        'Age': [54, 24, 22, 15, ],
        'Salary': [60000, 0, 35000, 0]}

In [73]:
method2_df = pd.DataFrame(r_dic)
method2_df

     Name  Age  Salary
0  Inayat   54   60000
1   Imaad   24       0
2    Atta   22   35000
3  Kaleem   15       0

In [76]:
raw_dic = {'Outlook':['Sunny', 'Sunny', 'Overcast', 'Rainy', 'Rainy', 'Rainy', 'Overcast', 'Sunny', 'Sunny', 'Rainy', 'Sunny', 'Overcast', 'Overcast', 'Rainy']
           ,'Temperature': ['Hot','Hot','Hot','Mild','Cool','Cool','Cool','Mild','Cool','Mild','Mild','Mild','Hot','Mild']
           ,'Humidity': ['High','High','High','High','Normal','Normal','Normal','High','Normal','Normal','Normal','High','Normal','High']
           ,'Wind': ['Weak','Strong','Weak','Weak','Weak','Strong','Strong','Weak','Weak','Weak','Strong','Strong','Weak','Strong']
           ,'Play': ['No','No','Yes','Yes','Yes','No','Yes','No','Yes','Yes','Yes','Yes','Yes','No']}

In [77]:
method2_df2 = pd.DataFrame(raw_dic)
method2_df2

     Outlook Temperature Humidity    Wind Play
0      Sunny         Hot     High    Weak   No
1      Sunny         Hot     High  Strong   No
2   Overcast         Hot     High    Weak  Yes
3      Rainy        Mild     High    Weak  Yes
4      Rainy        Cool   Normal    Weak  Yes
5      Rainy        Cool   Normal  Strong   No
6   Overcast        Cool   Normal  Strong  Yes
7      Sunny        Mild     High    Weak   No
8      Sunny        Cool   Normal    Weak  Yes
9      Rainy        Mild   Normal    Weak  Yes
10     Sunny        Mild   Normal  Strong  Yes
11  Overcast        Mild     High  Strong  Yes
12  Overcast         Hot   Normal    Weak  Yes
13     Rainy        Mild     High  Strong   No

## Method 3: Creating Dataframe from list of dicts

In [33]:
rdl = [{'Name': 'Inayat', 'Age': 54, 'Salary': 60000},
      {'Age': 24, 'Name': 'Imaad', 'Salary': 0},
      {'Salary': 35000, 'Name': 'Atta', 'Age': 22}]

In [78]:
method3_df = pd.DataFrame(rdl)
method3_df

   Age    Name  Salary
0   54  Inayat   60000
1   24   Imaad       0
2   22    Atta   35000

## Method 4: Creating DataFrame using zip() function.

In [79]:
names = ['Inayat', 'Imaad', 'Atta']
ages = [54, 24, 22]
salaries = [60000, 0, 35000]
zzip = zip(names, ages)
zzip
l = list(zzip)
l

[('Inayat', 54), ('Imaad', 24), ('Atta', 22)]

In [81]:
method4_df = pd.DataFrame(l, columns=['Names', 'Ages'])
method4_df

    Names  Ages
0  Inayat    54
1   Imaad    24
2    Atta    22

## Method 5: Creating DataFrame from Dictionaries of series.

In [55]:
dic = {'Name': pd.Series(['Inayat', 'Imaad', 'Atta']),
      'Age': pd.Series([54, 24, 22]),
      'Salaries': pd.Series([60000,0,35000])}

In [82]:
method5_df = pd.DataFrame(dic)
method5_df

     Name  Age  Salaries
0  Inayat   54     60000
1   Imaad   24         0
2    Atta   22     35000

## Method 6: Using lists in dictionary to create dataframe

In [101]:
names = ['Imaad', 'Aimal', 'Hasnain', 'Tariq']
degs = ['MS Data Science', 'MS Political Science', 'Mechanical Engineering', 'BBA']
scores = [85, 79, 92, 75]
dic = {'Names': names, 'Degrees': degs, 'Scores': scores}
method6_df = pd.DataFrame(dic)
method6_df

     Names                 Degrees  Scores
0    Imaad         MS Data Science      85
1    Aimal    MS Political Science      79
2  Hasnain  Mechanical Engineering      92
3    Tariq                     BBA      75

In [84]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [88]:
lst = [1,2,3,4,5,6,7,8,9]
dff = pd.DataFrame(lst, columns=['Numbers'])
dff

   Numbers
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8
8        9

In [95]:
test_batsmen = ['Virat Kohli', 'Steve Smith', 'Kane Williamson', 'Joe Root', 'David Warner']
odi_batsmen = ['Virat Kohli', 'Rohit Sharma', 'Joe Root', 'David Warner', 'Babar Azam']
t20_batsmen = ['Babar Azam', 'Aaron Finch', 'Colin Munro', 'Lokish Rahul', 'Fakhar Zaman']

ranking_batsmen = {'Tests': test_batsmen,
                  'ODIs': odi_batsmen,
                  'T20s': t20_batsmen}
index = 1

In [100]:
batsmen_ranking_df = pd.DataFrame(ranking_batsmen, index=['1','2','3','4','5'])
batsmen_ranking_df

             Tests          ODIs          T20s
1      Virat Kohli   Virat Kohli    Babar Azam
2      Steve Smith  Rohit Sharma   Aaron Finch
3  Kane Williamson      Joe Root   Colin Munro
4         Joe Root  David Warner  Lokish Rahul
5     David Warner    Babar Azam  Fakhar Zaman